{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 19402, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 19402, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.0010000000474974513, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of57.bin", "group1-shard2of57.bin", "group1-shard3of57.bin", "group1-shard4of57.bin", "group1-shard5of57.bin", "group1-shard6of57.bin", "group1-shard7of57.bin", "group1-shard8of57.bin", "group1-shard9of57.bin", "group1-shard10of57.bin", "group1-shard11of57.bin", "group1-shard12of57.bin", "group1-shard13of57.bin", "group1-shard14of57.bin", "group1-shard15of57.bin", "group1-shard16of57.bin", "group1-shard17of57.bin", "group1-shard18of57.bin", "group1-shard19of57.bin", "group1-shard20of57.bin", "group1-shard21of57.bin", "group1-shard22of57.bin", "group1-shard23of57.bin", "group1-shard24of57.bin", "group1-shard25of57.bin", "group1-shard26of57.bin", "group1-shard27of57.bin", "group1-shard28of57.bin", "group1-shard29of57.bin", "group1-shard30of57.bin", "group1-shard31of57.bin", "group1-shard32of57.bin", "group1-shard33of57.bin", "group1-shard34of57.bin", "group1-shard35of57.bin", "group1-shard36of57.bin", "group1-shard37of57.bin", "group1-shard38of57.bin", "group1-shard39of57.bin", "group1-shard40of57.bin", "group1-shard41of57.bin", "group1-shard42of57.bin", "group1-shard43of57.bin", "group1-shard44of57.bin", "group1-shard45of57.bin", "group1-shard46of57.bin", "group1-shard47of57.bin", "group1-shard48of57.bin", "group1-shard49of57.bin", "group1-shard50of57.bin", "group1-shard51of57.bin", "group1-shard52of57.bin", "group1-shard53of57.bin", "group1-shard54of57.bin", "group1-shard55of57.bin", "group1-shard56of57.bin", "group1-shard57of57.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [4096], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [4096], "dtype": "float32"}, {"name": "dense/kernel", "shape": [128, 4096], "dtype": "float32"}, {"name": "dense/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [4096, 2048], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [2048], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [2048, 19402], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [19402], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [19402, 512], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [512], "dtype": "float32"}]}]}